<a href="https://colab.research.google.com/github/sinjulee/chapter1-basic/blob/main/ex_0212_01.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np
import pandas as pd
import seaborn as sns

df = pd.read_csv("C:/Users/82102/OneDrive/데이터분석훈련/myPyExcel/data/ch05/electric_products.csv", encoding = 'utf-8')
df

   year  M1  M2    M3    M4
0  2014  20  15   NaN   NaN
1  2015  25  17  13.0   NaN
2  2016  24  19  15.0   NaN
3  2017  27  20  18.0  12.0
4  2018  30  19  17.0  14.0
5  2019  32  24  21.0  19.0

In [ ]:
%%writefile C:\Users\82102\OneDrive\데이터분석훈련\myPyExcel/data/ch05/korea_rain1.csv
연도, 봄, 여름, 가을, 겨울
2014, 215.9, 599.8, 293.1, 76.9
2015, 223.2, 387.1, 247.7, 109.1
2016, 312.8, 446.2, 381.6, 108.1
2017, 118.6, 609.7, 172.5, 75.6
2018, 368.1, 586.5, 351.2, 66.5

Writing C:\Users\82102\OneDrive\데이터분석훈련\myPyExcel/data/ch05/korea_rain1.csv

In [ ]:
#csv 파일 경로
folder = 'C:/Users/82102/OneDrive/데이터분석훈련/myPyExcel/data/ch05/' #폴더 경로
csv_file = folder + 'korea_rain1.csv' #파일 경로

#csv 파일을 읽어와서 Dataframe 데이터 생성
df = pd.read_csv(csv_file, encoding = 'utf-8')
df

     연도      봄     여름     가을     겨울
0  2014  215.9  599.8  293.1   76.9
1  2015  223.2  387.1  247.7  109.1
2  2016  312.8  446.2  381.6  108.1
3  2017  118.6  609.7  172.5   75.6
4  2018  368.1  586.5  351.2   66.5

In [ ]:
#텍스트 파일 경로
folder = 'C:/Users/82102/OneDrive/데이터분석훈련/myPyExcel/data/ch05/' #폴더 경로
txt_file = folder + 'korea_rain1_space.txt'

#공백으로 구분하는 텍스트 데이터 파일 생성
df=pd.read_csv(txt_file, sep=' ', encoding = 'utf-8')
df

     연도      봄     여름     가을     겨울
0  2014  215.9  599.8  293.1   76.9
1  2015  223.2  387.1  247.7  109.1
2  2016  312.8  446.2  381.6  108.1
3  2017  118.6  609.7  172.5   75.6
4  2018  368.1  586.5  351.2   66.5

In [ ]:
#텍스트 파일 경로
folder = 'C:/Users/82102/OneDrive/데이터분석훈련/myPyExcel/data/ch05/' #폴더 경로
txt_file = folder + 'korea_rain1_tab.txt'
#공백으로 구분하는 텍스트 데이터 파일 생성
df = pd.read_csv(txt_file, sep='\t',encoding = 'utf-8')
df

     연도      봄     여름     가을     겨울
0  2014  215.9  599.8  293.1   76.9
1  2015  223.2  387.1  247.7  109.1
2  2016  312.8  446.2  381.6  108.1
3  2017  118.6  609.7  172.5   75.6
4  2018  368.1  586.5  351.2   66.5

In [ ]:
%%writefile C:/Users/82102/OneDrive/데이터분석훈련/myPyExcel/data/ch05/korea_rain2.csv
2014, 215.9, 599.8, 293.1, 76.9
2015, 223.2, 387.1, 247.7, 109.1
2016, 312.8, 446.2, 381.6, 108.1
2017, 118.6, 609.7, 172.5, 75.6
2018, 368.1, 586.5, 351.2, 66.5

Writing C:/Users/82102/OneDrive/데이터분석훈련/myPyExcel/data/ch05/korea_rain2.csv

In [ ]:
#파일 경로
folder = 'C:/Users/82102/OneDrive/데이터분석훈련/myPyExcel/data/ch05/' #폴더 경로
txt_file = folder + 'korea_rain2.csv'

df2 = pd.read_csv(txt_file)
df2

   2014   215.9   599.8   293.1   76.9
0  2015   223.2   387.1   247.7  109.1
1  2016   312.8   446.2   381.6  108.1
2  2017   118.6   609.7   172.5   75.6
3  2018   368.1   586.5   351.2   66.5

In [ ]:
folder = 'C:/Users/82102/OneDrive/데이터분석훈련/myPyExcel/data/ch05/' #폴더 경로
txt_file = folder + 'korea_rain2.csv'

df2 = pd.read_csv(txt_file, header=None)

In [ ]:
folder = 'C:/Users/82102/OneDrive/데이터분석훈련/myPyExcel/data/ch05/' #폴더 경로
txt_file = folder + 'korea_rain2.csv'

name_list = ["Year", "Spring", "Summer", "Fall", "Winter"]
df2 = pd.read_csv(txt_file, names=name_list)
df2

   Year  Spring  Summer   Fall  Winter
0  2014   215.9   599.8  293.1    76.9
1  2015   223.2   387.1  247.7   109.1
2  2016   312.8   446.2  381.6   108.1
3  2017   118.6   609.7  172.5    75.6
4  2018   368.1   586.5  351.2    66.5

In [ ]:
folder = 'C:/Users/82102/OneDrive/데이터분석훈련/myPyExcel/data/ch05/' #폴더 경로
txt_file = folder + 'korea_rain1.csv'

name_list =["연도New","봄New","여름New","가을New","겨울New"]
df2 = pd.read_csv(txt_file, header=0, names=name_list)
df2

   연도New   봄New  여름New  가을New  겨울New
0   2014  215.9  599.8  293.1   76.9
1   2015  223.2  387.1  247.7  109.1
2   2016  312.8  446.2  381.6  108.1
3   2017  118.6  609.7  172.5   75.6
4   2018  368.1  586.5  351.2   66.5

In [ ]:
df = pd.DataFrame({"제품ID" : ['P1001','P1002','P1003','P1004'],"판매가격":[5000,7000,8000,9000],"판매량":[50,94,70,48]})
df

    제품ID  판매가격  판매량
0  P1001  5000   50
1  P1002  7000   94
2  P1003  8000   70
3  P1004  9000   48

In [ ]:
folder = 'C:/Users/82102/OneDrive/데이터분석훈련/myPyExcel/data/ch05/' #폴더 경로
csv_file = folder + 'product_sales1.csv'

df.to_csv(csv_file)
print("생성한 파일 : ", csv_file)

생성한 파일 :  C:/Users/82102/OneDrive/데이터분석훈련/myPyExcel/data/ch05/product_sales1.csv

In [ ]:
df.to_csv(csv_file, encoding='cp949',index=False)
print('생성한 CSV 파일 : ', csv_file)

생성한 CSV 파일 :  C:/Users/82102/OneDrive/데이터분석훈련/myPyExcel/data/ch05/product_sales1.csv

In [ ]:
folder = 'C:/Users/82102/OneDrive/데이터분석훈련/myPyExcel/data/ch05/' #폴더 경로
excel_file = folder + '사원별_월간_판매현황.xlsx'

df = pd.read_excel(excel_file)
df

    이름  1월  2월  3월  4월  5월   6월
0  양동호  69  54  76  34   67  56
1  조순열  65  47  85  12   56  34
2  박영순  76  85  57  42   89  91
3  고지영  98  69  23  82   67  87
4  지수경  45  39  56  98   34  53
5  오선호  56  34  56  76   95  73
6  진가연  90  57  34  44   58  96
7  최소진  45  63  76  15   85  54
8  한영미  81  75  23  97   53  95

In [ ]:
df = pd.read_excel(excel_file, index_col="이름")
df

     1월  2월  3월  4월  5월   6월
이름
양동호  69  54  76  34   67  56
조순열  65  47  85  12   56  34
박영순  76  85  57  42   89  91
고지영  98  69  23  82   67  87
지수경  45  39  56  98   34  53
오선호  56  34  56  76   95  73
진가연  90  57  34  44   58  96
최소진  45  63  76  15   85  54
한영미  81  75  23  97   53  95

In [ ]:
folder = 'C:/Users/82102/OneDrive/데이터분석훈련/myPyExcel/data/ch05/' #폴더 경로
excel_file = folder + '사원별_월간_판매현황2.xlsx'

df = pd.read_excel(excel_file, sheet_name='하반기', index_col=0)
df

     7월  8월  9월  10월  11월   12월
이름
양동호  67  50  74   39    71   54
조순열  67  47  87   56    60   31
박영순  79  90  55   45    86   94
고지영  99  67  19   84    66   87
지수경  43  37  56   96    32   52
오선호  53  34  61   72    92   70
진가연  93  59  30   49    61   98
최소진  44  68  79   53    81   55
한영미  85  78  22   75    52   93

In [ ]:
folder = 'C:/Users/82102/OneDrive/데이터분석훈련/myPyExcel/data/ch05/' #폴더 경로
excel_file = folder + '사원별_월간_판매현황_열이름없음.xlsx'

names_list = ["Names", "January","February","March","April","May","June"]
df=pd.read_excel(excel_file, header=None, names=names_list)
df

  Names  January  February  March  April  May  June
0   양동호       69        54     76     34   67    56
1   조순열       65        47     85     12   56    34
2   박영순       76        85     57     42   89    91
3   고지영       98        69     23     82   67    87
4   지수경       45        39     56     98   34    53
5   오선호       56        34     56     76   95    73
6   진가연       90        57     34     44   58    96
7   최소진       45        63     76     15   85    54
8   한영미       81        75     23     97   53    95

In [ ]:
folder = 'C:/Users/82102/OneDrive/데이터분석훈련/myPyExcel/data/ch05/' #폴더 경로
excel_file = folder + '사원별_월간_판매현황.xlsx'

names_list =["사원명", "1월달","2월달","3월달","4월달","5월달","6월달"]
df=pd.read_excel(excel_file,header=0,names=names_list)
df

   사원명  1월달  2월달  3월달  4월달  5월달  6월달
0  양동호   69   54   76   34   67   56
1  조순열   65   47   85   12   56   34
2  박영순   76   85   57   42   89   91
3  고지영   98   69   23   82   67   87
4  지수경   45   39   56   98   34   53
5  오선호   56   34   56   76   95   73
6  진가연   90   57   34   44   58   96
7  최소진   45   63   76   15   85   54
8  한영미   81   75   23   97   53   95

In [ ]:
folder = 'C:/Users/82102/OneDrive/데이터분석훈련/myPyExcel/data/ch05/' #폴더 경로
excel_file = folder + '사원별_월간_판매현황2.xlsx'

df1 = pd.read_excel(excel_file,sheet_name=0)
df2 = pd.read_excel(excel_file,sheet_name=1)
df1

    이름  1월  2월  3월  4월  5월   6월
0  양동호  69  54  76  34   67  56
1  조순열  65  47  85  12   56  34
2  박영순  76  85  57  42   89  91
3  고지영  98  69  23  82   67  87
4  지수경  45  39  56  98   34  53
5  오선호  56  34  56  76   95  73
6  진가연  90  57  34  44   58  96
7  최소진  45  63  76  15   85  54
8  한영미  81  75  23  97   53  95

In [ ]:
folder = 'C:/Users/82102/OneDrive/데이터분석훈련/myPyExcel/data/ch05/' #폴더 경로
excel_file = folder + '사원별_월간_판매현황.xlsx'

df1.to_excel(excel_file)
print("생성한 엑셀 파일:", excel_file)

생성한 엑셀 파일: C:/Users/82102/OneDrive/데이터분석훈련/myPyExcel/data/ch05/사원별_월간_판매현황.xlsx

In [ ]:
folder = 'C:/Users/82102/OneDrive/데이터분석훈련/myPyExcel/data/ch05/' #폴더 경로
excel_file = folder + '사원별_월간_판매현황_new2.xlsx'

df1.to_excel(excel_file, sheet_name='상반기', index=False)

print("생성한 엑셀 파일 :", excel_file)

생성한 엑셀 파일 : C:/Users/82102/OneDrive/데이터분석훈련/myPyExcel/data/ch05/사원별_월간_판매현황_new2.xlsx

In [ ]:
folder = 'C:/Users/82102/OneDrive/데이터분석훈련/myPyExcel/data/ch05/' #폴더 경로
excel_file = folder + '사원별_월간_판매현황_two_sheets.xlsx'

with pd.ExcelWriter(excel_file, engine='xlsxwriter')as excel_writer:
    df1.to_excel(excel_writer,sheet_name='상반기',index=False)
    df2.to_excel(excel_writer,sheet_name='하반기',index=False)
    
print("생성한 엑셀 파일 : ",excel_file)

생성한 엑셀 파일 :  C:/Users/82102/OneDrive/데이터분석훈련/myPyExcel/data/ch05/사원별_월간_판매현황_two_sheets.xlsx

In [ ]:
df1 = pd.DataFrame({'제품ID':['P1001','P1002','P1003','P1004'],
                    '판매가격':[5000,6000,7000,8000],'판매량':[50,94,56,35]})
df2 = pd.DataFrame({'제품ID':['P2001','P2002','P2003','P2004'],
                    '판매가격':[5200,6200,7200,8200],'판매량':[40,50,30,20]})
df3 = pd.DataFrame({'제품ID':['P3001','P3002','P3003','P3004'],
                    '판매가격':[5000,4000,2000,1000],'판매량':[20,60,40,50]})
df4 = pd.DataFrame({'제품ID':['P4001','P4002','P4003','P4004'],
                    '판매가격':[5000,6000,3600,9000],'판매량':[50,40,76,90]})

folder = 'C:/Users/82102/OneDrive/데이터분석훈련/myPyExcel/data/ch05/' #폴더 경로
excel_file = folder + 'product_sales_in_one_worksheet.xlsx'

excel_writer = pd.ExcelWriter(excel_file, engine='xlsxwriter')

df1.to_excel(excel_writer)
df2.to_excel(excel_writer,startrow=0,startcol=5,index=False)
df3.to_excel(excel_writer,startrow=6,startcol=0)
df4.to_excel(excel_writer,startrow=5,startcol=5,index=False,header=False)

excel_writer.save()

print("생성한 엑셀 파일 :",excel_file)

생성한 엑셀 파일 : C:/Users/82102/OneDrive/데이터분석훈련/myPyExcel/data/ch05/product_sales_in_one_worksheet.xlsx

In [ ]:
folder = 'C:/Users/82102/OneDrive/데이터분석훈련/myPyExcel/data/ch05/' #폴더 경로
csv_file = folder + 'korea_rain1.csv'

excel_file = folder + 'korea_rain1.xlsx'

df = pd.read_csv(csv_file)

df.to_excel(excel_file,index=False)

print("출력 엑셀 파일 : ", excel_file)

출력 엑셀 파일 :  C:/Users/82102/OneDrive/데이터분석훈련/myPyExcel/data/ch05/korea_rain1.xlsx

In [ ]:
folder = 'C:/Users/82102/OneDrive/데이터분석훈련/myPyExcel/data/ch05/' #폴더 경로
excel_file = folder + 'korea_rain1.xlsx'

output_csv_file = folder + 'korea_rain2_cp949.csv'

df = pd.read_excel(excel_file)

df.to_csv(output_csv_file,encoding='cp949',index=False)

print("출력 CSV 파일 : ",output_csv_file)

출력 CSV 파일 :  C:/Users/82102/OneDrive/데이터분석훈련/myPyExcel/data/ch05/korea_rain2_cp949.csv

In [ ]:
s1 = pd.Series([10,20,30,40,50])
s1

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [ ]:
s2 = pd.Series([1,2,3,4])
s2

0    1
1    2
2    3
3    4
dtype: int64

In [ ]:
s1 + s2

0    11.0
1    22.0
2    33.0
3    44.0
4     NaN
dtype: float64

In [ ]:
s1 - s2

0     9.0
1    18.0
2    27.0
3    36.0
4     NaN
dtype: float64

In [ ]:
s1 * s2

0     10.0
1     40.0
2     90.0
3    160.0
4      NaN
dtype: float64

In [ ]:
s1 / s2

0    10.0
1    10.0
2    10.0
3    10.0
4     NaN
dtype: float64

In [ ]:
s1 > 300

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [ ]:
dict_data1 = {'A':[1,2,3,4],'B':[10,20,30,40],'C':[100,200,300,400]}

df1 = pd.DataFrame(dict_data1)
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400

In [ ]:
dict_data2 = {'A':[6,7,8,9],'B':[60,70,80,90],'C':[600,700,800,900]}
df2 = pd.DataFrame(dict_data2)
df2

   A   B    C
0  6  60  600
1  7  70  700
2  8  80  800
3  9  90  900

In [ ]:
df1 + df2

    A    B     C
0   7   70   700
1   9   90   900
2  11  110  1100
3  13  130  1300

In [ ]:
df1 - df2

   A   B    C
0 -5 -50 -500
1 -5 -50 -500
2 -5 -50 -500
3 -5 -50 -500

In [ ]:
df1 * df2

    A     B       C
0   6   600   60000
1  14  1400  140000
2  24  2400  240000
3  36  3600  360000

In [ ]:
df1 / df2

          A         B         C
0  0.166667  0.166667  0.166667
1  0.285714  0.285714  0.285714
2  0.375000  0.375000  0.375000
3  0.444444  0.444444  0.444444

In [ ]:
df1 + 5

   A   B    C
0  6  15  105
1  7  25  205
2  8  35  305
3  9  45  405

In [ ]:
df1 ** 2

    A     B       C
0   1   100   10000
1   4   400   40000
2   9   900   90000
3  16  1600  160000

In [ ]:
df1 > 30

       A      B     C
0  False  False  True
1  False  False  True
2  False  False  True
3  False   True  True

In [ ]:

csv_file = "C:/Users/82102/OneDrive/데이터분석훈련/myPyExcel/data/ch05/korea_rain1.csv"

df = pd.read_csv(csv_file,encoding='utf-8',index_col='연도')
df

          봄     여름     가을     겨울
연도
2014  215.9  599.8  293.1   76.9
2015  223.2  387.1  247.7  109.1
2016  312.8  446.2  381.6  108.1
2017  118.6  609.7  172.5   75.6
2018  368.1  586.5  351.2   66.5

In [ ]:
df.mean()

 봄     247.72
 여름    525.86
 가을    289.22
 겨울     87.24
dtype: float64

In [ ]:
df.std()

 봄      96.193123
 여름    102.192872
 가을     83.273807
 겨울     19.909495
dtype: float64

In [ ]:
df.mean(axis=1)

연도
2014    296.425
2015    241.775
2016    312.175
2017    244.100
2018    343.075
dtype: float64

In [ ]:
df.std(axis=1)

연도
2014    221.150739
2015    114.166760
2016    146.548658
2017    246.936173
2018    213.261754
dtype: float64

In [ ]:
df.describe()

                봄          여름          가을          겨울
count    5.000000    5.000000    5.000000    5.000000
mean   247.720000  525.860000  289.220000   87.240000
std     96.193123  102.192872   83.273807   19.909495
min    118.600000  387.100000  172.500000   66.500000
25%    215.900000  446.200000  247.700000   75.600000
50%    223.200000  586.500000  293.100000   76.900000
75%    312.800000  599.800000  351.200000  108.100000
max    368.100000  609.700000  381.600000  109.100000

In [ ]:
index_data = ['a','b','c','d','e']
data = [0.0, 1.0, 2.0, 3.0, 4.0]
s1 = pd.Series(data,index=index_data)
s1

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [ ]:
s1.loc['a']

0.0

In [ ]:
s1.loc[['a','b','c','e']]

a    0.0
b    1.0
c    2.0
e    4.0
dtype: float64

In [ ]:
s1.loc['b':'d']

b    1.0
c    2.0
d    3.0
dtype: float64

In [ ]:
s1.iloc[1]

1.0

In [ ]:
s1.iloc[[0,3,4]]

a    0.0
d    3.0
e    4.0
dtype: float64

In [ ]:
s1.iloc[1:4]

b    1.0
c    2.0
d    3.0
dtype: float64

In [ ]:
s1.loc['a':'c']=10
s1

a    10.0
b    10.0
c    10.0
d     3.0
e     4.0
dtype: float64

In [ ]:
dict_data = {'A':[0,10,20,30,40,50], 'B':[0,0.1,0.2,0.3,0.4,0.5],'C':[0,100,200,300,400,500]}

index_data = ['a','b','c','d','e','f']

df1 = pd.DataFrame(dict_data, index=index_data)
df1

    A    B    C
a   0  0.0    0
b  10  0.1  100
c  20  0.2  200
d  30  0.3  300
e  40  0.4  400
f  50  0.5  500

In [ ]:
df1.loc["a"]

A    0.0
B    0.0
C    0.0
Name: a, dtype: float64

In [ ]:
df1.loc[['a','c','f']]

    A    B    C
a   0  0.0    0
c  20  0.2  200
f  50  0.5  500

In [ ]:
df1.iloc[2]

A     20.0
B      0.2
C    200.0
Name: c, dtype: float64

In [ ]:
index_data = ['a','b','c','d','e','f']
data = [0,1,2,3,4,5]

s2 = pd.Series(data,index=index_data)
s2

a    0
b    1
c    2
d    3
e    4
f    5
dtype: int64

In [ ]:
s2[2]

2

In [ ]:
s2[['a','c']]

a    0
c    2
dtype: int64

In [ ]:
s = pd.Series(range(-3,6))
s

0   -3
1   -2
2   -1
3    0
4    1
5    2
6    3
7    4
8    5
dtype: int64

In [ ]:
dict_data = {'지점':['서울','대전','대구','부산','광주'],
             '1월':[557,234,340,129,35],'2월':[355,234,675,804,123],'3월':[234,905,203,512,597]}

df = pd.DataFrame(dict_data)
df

   지점   1월   2월   3월
0  서울  557  355  234
1  대전  234  234  905
2  대구  340  675  203
3  부산  129  804  512
4  광주   35  123  597

In [ ]:
s[s>0]

4    1
5    2
6    3
7    4
8    5
dtype: int64

In [ ]:
s[(s>=-2) & (s%2 == 0)]

1   -2
3    0
5    2
7    4
dtype: int64

In [ ]:
df[df['1월']>=300]

   지점   1월   2월   3월
0  서울  557  355  234
2  대구  340  675  203

In [ ]:
df[(df['지점'] == '서울') | (df['지점'] =='부산')]

   지점   1월   2월   3월
0  서울  557  355  234
3  부산  129  804  512

In [ ]:
df[df['지점'].isin(['서울','부산'])]

   지점   1월   2월   3월
0  서울  557  355  234
3  부산  129  804  512

In [ ]:
dict_data = {'제품ID':['P1001','P1002','P1003','P1004'],
            '판매가격':[5000,6000,7000,8000],
             '판매량':[50,94,56,35], 
             '이익률':[0.30, 0.21, 0.15, 0.25]}

df2 = pd.DataFrame(dict_data)
df2

    제품ID  판매가격  판매량   이익률
0  P1001  5000   50  0.30
1  P1002  6000   94  0.21
2  P1003  7000   56  0.15
3  P1004  8000   35  0.25

In [ ]:
df.head(2)

   지점   1월   2월   3월
0  서울  557  355  234
1  대전  234  234  905

In [ ]:
df2['제품ID']

0    P1001
1    P1002
2    P1003
3    P1004
Name: 제품ID, dtype: object

In [ ]:
df2[['제품ID']]

    제품ID
0  P1001
1  P1002
2  P1003
3  P1004

In [ ]:
df2[['제품ID','이익률','판매가격']]

    제품ID   이익률  판매가격
0  P1001  0.30  5000
1  P1002  0.21  6000
2  P1003  0.15  7000
3  P1004  0.25  8000

In [ ]:
df2['이익률'] = 0.5
df2['이익률']

0    0.5
1    0.5
2    0.5
3    0.5
Name: 이익률, dtype: float64

In [ ]:
dict_data = {'A' : [0,1,2,3,4],'B' : [10,11,12,13,14], 'C':[20,21,22,23,24]}

index_data = ['a','b','c','d','e']

df = pd.DataFrame(dict_data, index=index_data)
df

   A   B   C
a  0  10  20
b  1  11  21
c  2  12  22
d  3  13  23
e  4  14  24

In [ ]:
df.loc['a','A']

0

In [ ]:
df.iloc[0,0]

0

In [ ]:
df.loc['a':'c',['A','B']]

   A   B
a  0  10
b  1  11
c  2  12

In [ ]:
df.iloc[0:3, 0:2]

   A   B
a  0  10
b  1  11
c  2  12

In [ ]:
df.loc[df['A']>2,['A','B']]

   A   B
d  3  13
e  4  14

In [ ]:
df.loc['a':'c',['A','C']]

   A   C
a  0  20
b  1  21
c  2  22

In [ ]:
df.iloc[3:5, 1:3]=100
df

   A    B    C
a  0   10   20
b  1   11   21
c  2   12   22
d  3  100  100
e  4  100  100

In [ ]:
df.loc[df['B']<70,'B']=70
df

   A    B    C
a  0   70   20
b  1   70   21
c  2   70   22
d  3  100  100
e  4  100  100

In [ ]:
df.loc[df['C']<30,'D'] = 40
df

   A    B    C     D
a  0   70   20  40.0
b  1   70   21  40.0
c  2   70   22  40.0
d  3  100  100   NaN
e  4  100  100   NaN

In [ ]:
dict_data = {'A':[1,2,3,4], 'B':[4,5,6,7],'C':[8,9,10,11]}

index_data = ['a','b','c','d']

df1 = pd.DataFrame(dict_data,index=index_data)
df1

   A  B   C
a  1  4   8
b  2  5   9
c  3  6  10
d  4  7  11

In [ ]:
df1['C'][[0,1,3]]

a     8
b     9
d    11
Name: C, dtype: int64

In [ ]:
df1['C']['a':'d']

a     8
b     9
c    10
d    11
Name: C, dtype: int64

In [ ]:
df1['C'][df1['B']>=5]

b     9
c    10
d    11
Name: C, dtype: int64

In [ ]:
df1.T

   a  b   c   d
A  1  2   3   4
B  4  5   6   7
C  8  9  10  11

In [ ]:
s3 = pd.Series([10,20,30,40, np.nan, 60])
s3

0    10.0
1    20.0
2    30.0
3    40.0
4     NaN
5    60.0
dtype: float64

In [ ]:
s3.drop(index=0)

1    20.0
2    30.0
3    40.0
4     NaN
5    60.0
dtype: float64

In [ ]:
s3.drop(index=[1,3,5])

0    10.0
2    30.0
4     NaN
dtype: float64

In [ ]:
folder = 'C:/Users/82102/OneDrive/데이터분석훈련/myPyExcel/data/ch05/' #폴더 경로
csv_file = folder + 'electric_products.csv'

df3 = pd.read_csv(csv_file, encoding='utf-8')
df3

   year  M1  M2    M3    M4
0  2014  20  15   NaN   NaN
1  2015  25  17  13.0   NaN
2  2016  24  19  15.0   NaN
3  2017  27  20  18.0  12.0
4  2018  30  19  17.0  14.0
5  2019  32  24  21.0  19.0

In [ ]:
df3.drop(index=[1,2])

   year  M1  M2    M3    M4
0  2014  20  15   NaN   NaN
3  2017  27  20  18.0  12.0
4  2018  30  19  17.0  14.0
5  2019  32  24  21.0  19.0

In [ ]:
df3.drop(columns=['M3','M4'])

   year  M1  M2
0  2014  20  15
1  2015  25  17
2  2016  24  19
3  2017  27  20
4  2018  30  19
5  2019  32  24

In [ ]:
s1 = pd.Series([10,20,30])
s1

0    10
1    20
2    30
dtype: int64

In [ ]:
s2 = pd.Series([40,50,60])

In [ ]:
s3 = pd.Series([70,80,90])

In [ ]:
pd.concat([s1,s2])

0    10
1    20
2    30
0    40
1    50
2    60
dtype: int64

In [ ]:
pd.concat([s1,s2],ignore_index=True)

0    10
1    20
2    30
3    40
4    50
5    60
dtype: int64

In [ ]:
pd.concat([s1,s2,s3],ignore_index=True)

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
8    90
dtype: int64

In [ ]:
df1=pd.DataFrame({'물리':[95,80,70,100],'화학':[50,80,30,100]})
df1

    물리   화학
0   95   50
1   80   80
2   70   30
3  100  100

In [ ]:
df2 = pd.DataFrame({'물리':[50,90],'화학':[67,90]})
df2

   물리  화학
0  50  67
1  90  90

In [ ]:
df3 = pd.DataFrame({'물리':[80,20]})
df3

   물리
0  80
1  20

In [ ]:
df4 = pd.DataFrame({'생명과학':[90,70,30,50],'지구과학':[80,50,60,70]})
df4

   생명과학  지구과학
0    90    80
1    70    50
2    30    60
3    50    70

In [ ]:
pd.concat([df1,df2],ignore_index=True)

    물리   화학
0   95   50
1   80   80
2   70   30
3  100  100
4   50   67
5   90   90

In [ ]:
pd.concat([df2,df3],ignore_index=True)

   물리    화학
0  50  67.0
1  90  90.0
2  80   NaN
3  20   NaN

In [ ]:
pd.concat([df2,df3],ignore_index=True,join='inner')

   물리
0  50
1  90
2  80
3  20

In [ ]:
pd.concat([df1,df4],axis=1)

    물리   화학  생명과학  지구과학
0   95   50    90    80
1   80   80    70    50
2   70   30    30    60
3  100  100    50    70

In [ ]:
pd.concat([df2,df4],axis=1)

     물리    화학  생명과학  지구과학
0  50.0  67.0    90    80
1  90.0  90.0    70    50
2   NaN   NaN    30    60
3   NaN   NaN    50    70

In [ ]:
pd.concat([df2,df4],axis=1,join='inner')

   물리  화학  생명과학  지구과학
0  50  67    90    80
1  90  90    70    50

In [ ]:
s1.append(s2,ignore_index=True)

0    10
1    20
2    30
3    40
4    50
5    60
dtype: int64

In [ ]:
s1.append([s2,s3],ignore_index=True)

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
8    90
dtype: int64

In [ ]:
df1.append(df2,ignore_index=True)

    물리   화학
0   95   50
1   80   80
2   70   30
3  100  100
4   50   67
5   90   90